---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.GetEntries
source: html/1a58fd7b-e423-87bf-5978-c5ca93ae8949.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.GetEntries Method

Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.

## Syntax (C#)
```csharp
public KeyBasedTreeEntries GetEntries()
```

## Returns
A copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is not built yet. The information about this KeyBasedTreeEntries object is not available.